spec/vcr/StripeWrapper/invalid_card_data/should_not_be_successful.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: UTF-8
      string: card[number]=4000000000000002&card[exp_month]=9&card[exp_year]=2020&card[cvc]=314
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/5.2.0
      Authorization:
      - Bearer sk_test_HgzjcEX1e2EMzGsihsPjIZXU00AthWlTdD
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_MARW7LiNFoH9Ly","request_duration_ms":851}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"5.2.0","lang":"ruby","lang_version":"2.6.3 p62 (2019-04-16)","platform":"x86_64-darwin18","engine":"ruby","publisher":"stripe","uname":"Darwin
        Katherines-MacBook-Pro.local 18.7.0 Darwin Kernel Version 18.7.0: Tue Aug
        20 16:57:14 PDT 2019; root:xnu-4903.271.2~2/RELEASE_X86_64 x86_64","hostname":"Katherines-MacBook-Pro.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 28 Sep 2019 11:32:07 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '786'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_GCmuHyNKF6U4pX
      Stripe-Version:
      - '2019-09-09'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1FNe9jFwnVEodejJBbiXWzb1",
          "object": "token",
          "card": {
            "id": "card_1FNe9iFwnVEodejJfk2boGLA",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 9,
            "exp_year": 2020,
            "fingerprint": "EETD89zy6DOtH7Uf",
            "funding": "credit",
            "last4": "0002",
            "metadata": {
            },
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "107.77.215.196",
          "created": 1569670327,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: 
  recorded_at: Sat, 28 Sep 2019 11:32:07 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: amount=999&currency=usd&description=MyFlix+subscription&source=tok_1FNe9jFwnVEodejJBbiXWzb1
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/5.2.0
      Authorization:
      - Bearer sk_test_HgzjcEX1e2EMzGsihsPjIZXU00AthWlTdD
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_GCmuHyNKF6U4pX","request_duration_ms":563}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"5.2.0","lang":"ruby","lang_version":"2.6.3 p62 (2019-04-16)","platform":"x86_64-darwin18","engine":"ruby","publisher":"stripe","uname":"Darwin
        Katherines-MacBook-Pro.local 18.7.0 Darwin Kernel Version 18.7.0: Tue Aug
        20 16:57:14 PDT 2019; root:xnu-4903.271.2~2/RELEASE_X86_64 x86_64","hostname":"Katherines-MacBook-Pro.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Sat, 28 Sep 2019 11:32:07 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '269'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_XzxuqFMtUpcy3p
      Stripe-Version:
      - '2019-09-09'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "charge": "ch_1FNe9jFwnVEodejJMWSldtiB",
            "code": "card_declined",
            "decline_code": "generic_decline",
            "doc_url": "https://stripe.com/docs/error-codes/card-declined",
            "message": "Your card was declined.",
            "type": "card_error"
          }
        }
    http_version: 
  recorded_at: Sat, 28 Sep 2019 11:32:08 GMT
recorded_with: VCR 5.0.0
